app/Controllers/Credentials.php

    public function loginPost()
    {

        helper('user');
        $userModel = new UserModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $userModel->select('id,username,password,type')->where('username', $username)->first();
---
SELECT `id`, `username`, `password`, `type`
FROM `users`
WHERE `username` = 'abraham'
AND `users`.`deleted_at` IS NULL
 LIMIT 1