app/Controllers/User.php

SELECT *
FROM `users`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function index()
    {
        $user = new UserModel();
        $session = session();

        if ($session->type == 'it') {
            $data = [
                'users' => $user->asObject()->withDeleted()->paginate(10),
                'pager' => $user->pager,
                'session' => $session
            ];